export const hindi = {
  navbar: {
    search: "खोजें",
    kidMode: "बच्चों का मोड",
    favorite: "पसंदीदा",
    watchLater: "बाद में देखें",
    history: "इतिहास",
    language: "भाषा",
    theme: {
      darkMode: "डार्क मोड",
      lightMode: "लाइट मोड",
    },
    logout: "लॉगआउट",
    tvSeries: "टीवी सीरीज़",
    home: "मुखपृष्ठ",
    more: "अधिक",
    english: "अंग्रेज़ी",
    hindi: "हिन्दी",
  },

  searchBar: {
    search: "खोजें",
    AIModeOn: "AI मोड चालू है",
    TurnOnAIMode: "AI मोड चालू करें",
    clearHistory: "इतिहास मिटाएँ",
    toastOn: "AI मोड चालू किया गया।",
    toastOff: "AI मोड बंद किया गया!",
    emptyQueryError: "ऊपर टाइप करें और अपनी पसंदीदा फिल्में या शो खोजें!!",
    dataEmptyOrError: {
      error1: "ऊप्स! TMDB ने जवाब देने से इंकार कर दिया!!",
      error2: "यह एक मुफ्त API है — थोड़ी देर बाद फिर से प्रयास करें!",
    },
    lengthZeroError: {
      error1: "हम्म... आपके अनुरोध से मेल खाने वाली कोई चीज़ नहीं मिली!!!",
      error2: "अपना इनपुट बदलकर देखें — या शायद Gemini थोड़ी झपकी ले रहा है!",
    },
    placeholder: "कुछ भी खोजें....",
  },

  springModal: {
    titleOn: "बच्चों का मोड चालू करें?",
    titleOff: "बच्चों का मोड बंद करें?",
    descriptionOn:
      "बच्चों का मोड अभी बंद है। यह फीचर चालू करने पर बच्चों के लिए सुरक्षित अनुभव देता है। क्या आप इसे चालू करना चाहते हैं?",
    descriptionOff:
      "बच्चों का मोड अभी चालू है। यह फीचर चालू करने पर बच्चों के लिए सुरक्षित अनुभव देता है। क्या आप इसे बंद करना चाहते हैं?",
    turnOn: "चालू करें",
    turnOff: "बंद करें",
    cancel: "रद्द करें",
    toastOn: "बच्चों का मोड चालू किया गया",
    toastOff: "बच्चों का मोड बंद किया गया",
  },

  toast: {
    favorite: {
      added: "पसंदीदा में जोड़ा गया।",
      removed: "पसंदीदा से हटाया गया।",
    },
    searchHistory: {
      removed: "खोज इतिहास से हटाया गया।",
      cleared: "खोज इतिहास मिटा दिया गया!",
    },
    watchHistory: {
      removed: "देखने के इतिहास से हटाया गया।",
      cleared: "देखने का इतिहास मिटा दिया गया!",
    },
    watchLater: {
      added: "बाद में देखने में जोड़ा गया।",
      removed: "बाद में देखने से हटाया गया।",
    },
  },

  footer: {
    copyright: "© 2025 रोहित. सर्वाधिकार सुरक्षित।",
    description:
      "यह केवल शैक्षणिक उद्देश्यों के लिए बनाया गया है। Netflix से कोई संबंध नहीं है। सभी मूवी डेटा TMDB से लिया गया है।",
    credits: "डिज़ाइन और विकास:",
    name: "रोहित",
  },
};
